       IDENTIFICATION DIVISION.
       PROGRAM-ID. ReadDrinks.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DRINKS-FILE ASSIGN TO "vocab-drinks.csv"
               ORGANISATION LINE IS SEQUENTIAL.

      DATA DIVISION.
      FILE SECTION.
      FD DRINKS-FILE.
      01 DRINKS-REC PIC X(100).

      WORKING-STORAGE SECTION.
      01 EN-DRINK  PIC X(30).
      01 PL-DRINK  PIC X(30).
      01 COMMA-POS PIC 99.
      01 LINE-COUNT PIC 9 VALUE 0.
      01 EOF       PIC 9 VALUE 0.

      PROCEDURE DIVISION.