IDENTIFICATION DIVISION.
PROGRAM-ID. Interests.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 PRINCIPAL          PIC 9(6)V99 VALUE 0.
01 RATE               PIC 9(3)V99 VALUE 0.
01 TIME-IN            PIC 9(2) VALUE 0.
01 INTEREST           PIC 9(6)V99 VALUE 0.
01 OPTION             PIC 9(1) VALUE 0.
01 COMPOUND-INTEREST  PIC 9(6)V99 VALUE 0.
01 TOTAL-AMOUNT       PIC 9(6)V99 VALUE 0.
01 YEAR-COUNTER       PIC 9(2) VALUE 0.
01 TEMP-PRINCIPAL     PIC 9(6)V99 VALUE 0.

PROCEDURE DIVISION.

    DISPLAY "Enter principal amount: "
    ACCEPT PRINCIPAL

    DISPLAY "Enter the rate of interest (in percentages): "
    ACCEPT RATE

    DISPLAY "Enter time (in years): "
    ACCEPT TIME-IN

    DISPLAY "Select interest type: "
    DISPLAY "1 - Simple Interest"
    DISPLAY "2 - Compound Interest"
    ACCEPT OPTION

    IF OPTION = 1
        COMPUTE INTEREST = (PRINCIPAL * RATE * TIME-IN) / 100
        COMPUTE TOTAL-AMOUNT = PRINCIPAL + INTEREST
        DISPLAY "Simple interest is: " INTEREST
        DISPLAY "Total Amount (P + I) is: " TOTAL-AMOUNT

    ELSE IF OPTION = 2
        MOVE PRINCIPAL TO TEMP-PRINCIPAL
        MOVE 0 TO YEAR-COUNTER

        PERFORM VARYING YEAR-COUNTER FROM 1 BY 1 UNTIL YEAR-COUNTER > TIME-IN
            COMPUTE TEMP-PRINCIPAL = TEMP-PRINCIPAL * (1 + RATE / 100)
        END-PERFORM

        COMPUTE COMPOUND-INTEREST = TEMP-PRINCIPAL - PRINCIPAL
        COMPUTE TOTAL-AMOUNT = PRINCIPAL + COMPOUND-INTEREST

        DISPLAY "Compound interest is: " COMPOUND-INTEREST
        DISPLAY "Total Amount (P + CI) is: " TOTAL-AMOUNT

    ELSE
        DISPLAY "INVALID CHOICE"
    END-IF

    STOP RUN.
