IDENTIFICATION DIVISION.
PROGRAM-ID. coboltut.
AUTHOR. Corina P.
DATE-WRITTEN.November 2nd 2025
ENVIRONMENT DIVISION.

DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
01 UserName PIC X(30) VALUE "You".
01 Num1    PIC 9 VALUE ZEROS.
01 Num2    PIC 9 VALUE ZEROS.
01 TOTAL   PIC 99 VALUE 0.
01 SSNum.
          02 SSArea PIC 999.
          02 SSGroup PIC 99.
          02 SSSerial PIC 9999.
01 PIVALUE CONSTANT 3.14.
*> this is how comments are done

PROCEDURE DIVISION.
DISPLAY "What is your name " WITH NO ADVANCING
ACCEPT Username
DISPLAY "Hello " UserName

MOVE ZERO TO UserName
DISPLAY UserName


STOP RUN.
